Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/witnesses/hostile_witness.html.txt.tmx
Source language: en
Languages: ga

source: A hostile witness is a witness who at some point after the person has been sworn in to give evidence in court, appears unwilling to tell the truth
ga: Is éard is finné naimhdeach ann ná finné a bhfuil an cuma ar an scéal, ag pointe áirithe tar éis an duine a chur faoi mhionn chun fianaise a thabhairt i gcúirt, nach bhfuil sé/sí sásta an fhírinne a insint

source: Normally, the party that calls you as a witness does so in the belief that you will provide the court with evidence similar to the account you provided earlier in a pre-trial statement
ga: Go hiondúil, nuair a ghlaonn páirtí ort mar fhinné déantar é sin ag creideamh go dtabharfaidh tú fianaise don chúirt atá cosúil leis an gcuntas a chur tú ar fáil níos luaithe sa ráiteas réamh-trialach

source: If you do not give the evidence expected, very little can be done
ga: Mura dtugann tú an fhianaise a bhfuiltear ag súil leis, is beag ar fad gur féidir a dhéanamh

source: If, however, you go further and start telling lies or refuse to answer questions, the party who called you can apply to the judge to have you declared a hostile witness
ga: Más rud é, áfach, go dtéann tú níos faide agus go dtosaíonn tú ag insint bréaga, nó go ndiúltaíonn tú ceisteanna a fhreagairt, is féidir leis an bpáirtí a ghlaoigh ort iarratas a dhéanamh leis an mbreitheamh chun tú a dhearbhú mar fhinné naimhdeach

source: When your evidence under oath begins to change materially from the account that you provided earlier in a pre-trial statement, the counsel or barrister calling you can apply to the judge for a decision as to whether or not you are hostile
ga: Nuair a thosaíonn do chuid fianaise faoi mhionn ag athrú go bunúsach ón gcuntas a chur tú ar fáil i ráiteas réamh-trialach, is féidir leis an abhcóide a ghlaoigh ort iarratas a dhéanamh leis an mbreitheamh ar chinneadh an bhfuil nó nach bhfuil tú naimhdeach

source: This application must be made to the judge in the absence of the jury
ga: Caithfear an t-iarratas seo a dhéanamh leis an mbreitheamh gan an giúiré a bheith i láthair

source: The judge decides (largely on your demeanour and credibility) whether or not to treat you as a hostile witness
ga: Déanann an breitheamh cinneadh (bunaithe ar d'iompar agus ar do chreidiúnacht don chuid is mó) an gcaithfear leat mar fhinné naimhdeach

source: The judge also has to distinguish between a hostile witness and an unfavourable witness
ga: Caithfidh an breitheamh idirdhealú a dhéanamh freisin idir finné naimhdeach agus finné neamhfhabhrach

source: Just because you give unhelpful or unfavourable evidence it does not mean the party calling you can attack your credibility
ga: Díreach mar gheall go dtugann tú fianaise neamhchabhrach nó neamhfhabhrach ní chiallaíonn sé sin gur féidir leis an bpáirtí atá ag glaoch ort ionsaí a dhéanamh ar do chreidiúnacht

source: What happens if I am ruled as a hostile witness?
ga: Cad a tharlaíonn má rialaítear gur finné naimhdeach mé?

source: Normally, if a counsel or barrister calls you as a witness, the calling barrister is not permitted to attack your credibility or cross-examine you as if you were a witness for the other side
ga: Go hiondúil, má ghlaonn abhcóide ort mar fhinné, ní féidir leis an abhcóide atá ag glaoch ort ionsaí a dhéanamh ar do chreidiúnacht ná croscheistiú a chur ort cosúil le gur finné don taobh eile a bhí ionat

source: He/she cannot ask questions about, or introduce evidence of, your bad character, past convictions, prior inconsistent statements or bias
ga: Ní féidir leis/léi ceisteanna a chur ort faoi, ná fianaise a thabhairt isteach ar, do dhrochcháil, ciontuithe roimhe seo, ráitis neamh-chomhsheasmhacha roimhe seo ná claontacht

source: Also, the calling barrister cannot ask leading questions to get you to say what the barrister wants
ga: Freisin, ní féidir leis an abhcóide atá ag glaoch ort treoircheisteanna a chur ort le go ndéarfaidh tú an méid atá an abhcóide ag iarraidh go ndéarfaidh tú

source: Where you are ruled as hostile, the barrister calling you may:
ga: Nuair a rialaítear naimhdeach thú, is féidir leis an abhcóide atá ag glaoch:

source: • Ask leading questions in an effort to get you to say what they want
ga: • Treoircheisteanna a chur ort mar iarracht le go ndéarfaidh tú an rud atá uaidh/uaithi

source: • Cross-examine you on your previous statement made before the trial
ga: • Croscheistiú a dhéanamh ort faoi do ráiteas roimhe sin a rinne tú sular thosaigh an triail

source: If you are cross-examined on your previous statement, that statement is only evidence of your inconsistency and is not proof of the facts contained in the statement
ga: Má dhéantar croscheistiú ort faoi do ráiteas roimhe sin, níl sa ráiteas sin ach fianaise ar do neamh-chomhsheasmhacht agus ní fianaise é ar na fíricí atá ar fáil sa ráiteas

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil

source: Procedure followed when a witness is declared hostile
ga: Nós imeachta a leantar nuair a dearbhaítear finné a bheith naimhdeach

source: The following is a summary of the procedure that is adopted when a witness is accused of contradicting his/her previous statement while in the witness box:
ga: Is achoimre í an méid seo a leanas ar an nós imeachta a ghlactar nuair a chuirtear i leith finné go bhfuil sé/sí ag cur an bhréag ar a ráiteas roimhe sin le linn dó/di a bheith ar chlár na mionn

source: • Counsel or barrister makes an application to the judge in the absence of the jury and puts before the judge the statement upon which it is sought to have the witness declared a hostile witness
ga: • Déanann abhcóide iarratas leis an mbreitheamh gan an giúiré a bheith i láthair agus cuirtear ráiteas roimh an mbreitheamh ina iarrtar an finné a dhearbhú a bheith ina fhinné naimhdeach

source: • If the judge rules that the witness may be treated as a hostile witness, in the presence of the jury it is put to the witness that the witness had previously made a statement which differed materially from, or contradicted the one he/she was making in the witness box
ga: • Má rialaíonn an breitheamh gur féidir caitheamh leis an bhfinné mar fhinné naimhdeach, i láthair an ghiúiré deirtear leis an bhfinné go ndearna an finné ráiteas roimhe sin a bhí difriúil go bunúsach ó, nó a chuir an bhréag ar an gceann a bhí sé/sí ag déanamh ar chlár na mionn

source: • If the witness denies this, the witness is then asked to stand down from the witness box
ga: • Má shéanann an finné roimh seo, iarrtar ansin ar an bhfinné seasamh síos ó chlár na mionn

source: • To prove that the witness made the statement, the Garda who took the statement goes into the witness box and proves to the judge that the statement was made (without revealing the contents of the statement)
ga: • Le cruthú go ndearna an finné an ráiteas, téann an Garda a thóg an ráiteas chuig clár na mionn agus chruthaíonn sé/sí don bhreitheamh go ndearnadh an ráiteas (gan an méid atá sa ráiteas a nochtadh)

source: • The witness is then asked to go back into the witness box and the statement is shown to the witness for identification
ga: • Iarrtar ar an bhfinné ansin dul ar ais ar chlár na mionn agus taispeáintear an ráiteas don fhinné chun é a aithint

source: The witness’s attention is drawn to the part of the statement in which the contradiction or difference occurs
ga: Tarraingítear aird an fhinné chuig an gcuid den ráiteas ina bhfuil an difríocht nó atá ag cur an bhréag ar an méid atá sé/sí ag rá anois

source: • If the witness agrees that there is a contradiction or difference between the statement and his/her evidence to the court, then that is the end of the matter in relation to discrediting the witness’s credibility
ga: • Má aontaíonn an finné go bhfuil an ráiteas difriúil nó ag cur an bhréag ar a cuid/chuid fianaise leis an gcúirt, sin deireadh an scéil ansin maidir le hamhras a chaitheamh ar chreidiúnacht an fhinné

source: • If, however, the witness persists in denying the contradiction, then the statement is read into evidence, that is, read to the jury as proof of the fact that the witness made a contradictory or different statement, to the evidence the witness offered while in the witness-box
ga: • Más rud é, áfach, go leanann an finné air/uirthi ag séanadh go bhfuil sé ag cur an bhréag ar a cuid/chuid fianaise, ansin léitear an ráiteas isteach san fhianaise, sé sin, léitear don ghiúiré é mar chruthúnas ar an bhfíric go ndearna an finné ráiteas a bhí difriúil nó ag cur an bhréag ar an bhfianaise a chur an finné ar fáil le linn dó/di a bheith ar chlár na mionn

source: • Where the statement is read into evidence, the judge must make it clear to the jury that what the witness has said in the written statement is not evidence of the facts in the statement, but only evidence relating to the credibility of the witness
ga: • Nuair a léitear ráiteas isteach san fhianaise, caithfidh an breitheamh é a dhéanamh soiléir don ghiúiré nach bhfuil an méid a dúirt an finné sa ráiteas scríofa ina fhianaise ar fhíricí an ráitis, agus nach bhfuil sé ach ina fhianaise a bhaineann le chreidiúnacht an fhinné
